var g_Interval = 1;
var g_PersonCount = 500;//参加抽奖人数
var g_Timer;
var running = false;
function beginRndNum(trigger){
	if(running){
		running = false;
		clearTimeout(g_Timer);		
		$(trigger).val("开始");
		$('#ResultNum').css('color','red');
	}
	else{
		running = true;
		$('#ResultNum').css('color','black');
		$(trigger).val("停止");
		beginTimer();
	}
}

function updateRndNum(){
	//var num = Math.floor(Math.random()*g_PersonCount+1);
	//此处只需要把你需要用到的圣经章节写到数组里面即可,每个用逗号隔开
	var arr = [
		//(彼前，彼后，约壹、贰叁)
		'彼前1:13','彼前1:15-16','彼前2:9','彼前2:24','彼前4:7-8','彼前5:7','约壹1:7','约壹2:5','约壹2:15','约壹3:18',

		//(罗、弗)
		'罗8:28','罗12:9-10','罗12:11','罗12:17-18','弗4:2-3','箴16:32','路16:10','诗119:37-38',

		//耶利米书、雅歌
		'耶2:1-2','耶29:11-12','歌2:16-17','雅歌8:6',

		//(希伯来书)
		'来3:14','来7:25','来10:25','来10:35','来11:1','来11:6','来12:14','来12:28',

		//(约伯记)
		'伯 1:21','伯 9:3-4','伯 22:21','伯 23:11-12','伯 27:8','伯 34:21-22',

		//(以赛亚书)
		'赛6:8','赛12:2','赛33:6','赛40:29','赛40:31','赛54:10','赛58:10','赛61:11',

		//(马太福音)
		'太6:25','太7:21','太7:13-14','太6:34','太7:8','太16:26','太11:28',

		//创世纪、传道书、何西阿书
		'何6:3','弥6:8','申32:39',

		//(诗篇)
		'诗19:14','诗25:12', '诗27:4', '诗27:14', '诗34:8','诗34:9', '诗37:5',

		//提摩太前/后书
		'提后2:22','提前2:8','提前2:9-10','提前4:8','提前4:12','提前6:6-8','腓4:6-7',

		//诗篇（50节后）
		'诗51:17','诗62:1-2','诗73:25-26','诗90:10',

		//(箴言)
		'箴18:10','箴16:20','箴16:9','箴15:17','箴15:16','箴14:27','箴14:26','箴10:12','箴9:10','箴8:35','箴8:17','箴3:6','箴3:5',

		//(约翰福音)
		'约3:16','约4:14','约4:23-24','约6:27','约6:35','约8:12','约12:24',

		//(腓立比书)
		'腓3:8','腓4:6-7','腓4:19','歌3:12','歌3:13-14','歌3:23-24','箴28:13','箴27:1',
	];
	var index = Math.floor((Math.random()*arr.length)); 
	$('#ResultNum').html(arr[index]);
}

function beginTimer(){
	g_Timer = setTimeout(beat, g_Interval);
}

function beat() {
	g_Timer = setTimeout(beat, g_Interval);
	updateRndNum();
}